<template>
    <div>
        <div class="ms-doc">
            <article class="markdown-section" id="main"><p>
            聚链技术平台为我们提供了基于区块链业务的各种行业解决方案。基于聚链技术平台，我们可以快速的搭建和部署区块链应用，安全轻松的监控
            链上数据，同时进行链上大数据分析以满足相关业务系统要求。聚链提供私有链和公有链两种运行环境，用户可以选择私网环境独立部署私有链，
            也可以选择公网环境与聚链公有链连接达成更佳高效的数据共享业务。
            </p>
                <h3>区块特性</h3>
                <ul>
                    <li>极短区块生成时间，TPS为700~1000笔交易；</li>
                    <li>采用DPOS共识算法；</li>
                    <li>客户端自动升级，避免分叉带来一系列问题；</li>
                </ul>
                <h3>易用性</h3>
                <ul>
                    <li>聚链客户端可在几秒钟内开启使用；</li>
                    <li>钱包具备连接远程节点快速开始的功能，无需加载完整的链帐本；</li>
                    <li>可直接与任何Java，Javascript等应用系统集成；</li>
                    <li>提供多种在线合约应用模板和快速测试；</li>
                </ul>
                <h3>安全性</h3>
                <ul>
                    <li>能过聚链监控中心，我们可以监控整个链上的所有节点和区块数据；</li>
                    <li>支持帐户进行多重签名规则；</li>
                    <li>针对非法获得的帐户进行锁定；</li>
                    <li>针对可疑大额交易进行预锁定与确认；</li>
                </ul>
                <h3>可扩展性</h3>
                <ul>
                    <li>类似于CDN网络架构，我们可以自主就近选择连接全球范围内任意一个聚链网络中的节点；</li>
                    <li>基于聚链技术平台，快速部署各种合约应用；</li>
                    <li>基于聚链技术平台，快速构建更多的业务系统；</li>
                </ul>

            </article>
        </div>

    </div>
</template>

<script>
    export default {
        data: function(){
            return {}
        }
    }
</script>

<style scoped>

</style>
