<template>
    <div>
        <div class="ms-doc">
            <article class="markdown-section" id="main"><p>为将区块链性能提升至全新高度，聚链真正100%全新代码。使开发者可以迅速和节省成本部署基于区块链的应用。聚链提供了可靠签名合约保障极高的安全性。由多层架构保障高吞吐量的实现，使应用仅在区块链层面存储核心信息，使区块链层高效安全运营。私有链和公有链的无缝集成，用户可以选择私网环境独立部署，也可以选择公网环境与公有链连接达成更佳的数据管理。</p>
                <h3>易用性</h3>
                <ul>
                <li>极短块时间</li>
                <li>钱包具备连接远程节点快速开始的功能，无需加载完整链</li>
            </ul>
                <h3>安全性和用户保护</h3>
                <ul>
                    <li>聚链的360块后完全不可变特性使得POW或POS区块链存在的长期入侵成功可能性成为过去</li>
                    <li>聚链使用 Eigentrust++算法评估节点质量，踢出不健康的低声望节点，保护区块链健壮性</li>
                </ul>
                <h3>可达性</h3>
                <ul>
                    <li>可以自主选择连接全球范围内任意一个聚链网络中的节点，也可以由带有View功能的DNS连接公共推荐节点，有利于轻量或移动APP的实施</li>
                    <li>聚链软件在几秒钟内就能安装（或解压）完成开启使用，连接远程节点后可立即开始区块链操作</li>
                </ul>
            </article>
        </div>

    </div>
</template>

<script>
    export default {
        data: function(){
            return {}
        }
    }
</script>

<style scoped>
</style>
